Ruby/lojadecamisetas/app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 2]]
---
	def index
		@produtos_por_nome = Produto.order(:nome).limit 10
		@produtos_por_preco = Produto.order(:preco).limit 2

UPDATE "produtos" SET "descricao" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "Filha linda de mais :) mesmo"], ["updated_at", "2017-07-29 00:47:19.180320"], ["id", 21]]
---
	def update
		if @produto.update produto_params

INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Teste01"], ["descricao", "teste01"], ["quantidade", 10], ["preco", 10.0], ["created_at", "2017-07-22 12:01:18.131626"], ["updated_at", "2017-07-22 12:01:18.131626"]]
---
	def create
		@produto = Produto.new produto_params

		if @produto.save

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
	def set_produto
		id = params[:id]
		@produto = Produto.find(id)